app/controllers/forms_controller.rb

  def index

    if current_user.try(:role) == "admin"
      @forms = Form.where("completed = ?", "0")
---
SELECT `forms`.* FROM `forms` WHERE (completed = '0') ORDER BY `forms`.`created_at` ASC

  def edit
    if current_user.try(:role) == "agent"
      if current_user.paynum != @form.paynum and current_user.id != @form.user_id
        redirect_to root_url
      end
    end

    @form = Form.find(params[:id])
---
SELECT "forms".* FROM "forms" WHERE "forms"."id" = $1 LIMIT 1  [["id", "6"]]
SELECT `users`.* FROM `users` WHERE `users`.`id` = 31 ORDER BY `users`.`id` ASC LIMIT 1

  def create
    @form = Form.new(form_params)
    @form.user_id = current_user.id

    respond_to do |format|
      if @form.save
---
INSERT INTO "forms" ("antivir_type", "completed", "computer_name", "created_at", "email", "equipment_type", "first_name", "last_name", "office_number", "os_type", "paynum", "phone_number", "printer_ip", "technician_name", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"

  def update
    respond_to do |format|
      if @form.update(form_params)
---
UPDATE "forms" SET "paynum" = $1, "antivir_expire_date" = $2, "updated_at" = $3, "printer_ip" = $4 WHERE "forms"."id" = 2

  def destroy
    @form.destroy
---
DELETE FROM "forms" WHERE "forms"."id" = $1  [["id", 6]]

    def set_form
      @form = Form.find(params[:id])
---
SELECT "forms".* FROM "forms" WHERE "forms"."id" = $1 LIMIT 1  [["id", "6"]]