app/controllers/users_controller.rb

  def sign_em_in

    sent_params = params[:user]

    # Check if the user is already signed up looking up their unique pay number
    if User.find_by paynum: sent_params[:paynum]
        @user = User.find_by paynum: sent_params[:paynum]
        sign_in @user
    else

      @user = User.new(user_params)

      #If the user isn't able to save it means that eaither the paynumber is already in use or the form was filled out wrong.
      #This really isn't going to be a form, This will be a mini form link on the REO Intranet.
      if @user.save!
---
SELECT `users`.* FROM `users` WHERE `users`.`paynum` = 88888 LIMIT 1
INSERT INTO `users` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_sign_in_at`, `last_sign_in_ip`, `paynum`, `sign_in_count`, `updated_at`, `username`) VALUES ('2014-09-05 04:30:48', '2014-09-05 04:30:48', '192.168.1.66', 'bholland@realestateone.com', '$2a$10$PGRCX2u9.R8/QU7sFYSz7eUssxqIoTJ0hyNj62.7W8gi6re5BM7La', '2014-09-05 04:30:48', '192.168.1.66', '654098', 1, '2014-09-05 04:30:48', 'bholland')

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `encrypted_password`, `office_number`, `paynum`, `updated_at`, `username`) VALUES ('2014-09-09 03:02:38', '$2a$10$8g97kQ/hCwZFboXbzN3hK.fLyg9NQNR63o6vuRpgRS75lj9wASLcm', '13', '12345', '2014-09-09 03:02:38', '123456')

  def update

    if params[:user][:password].blank?
        params[:user].delete(:password)
        params[:user].delete(:password_confirmation)
    end

    respond_to do |format|

      if @user.update(user_params)
---
UPDATE `users` SET `username` = 'user', `encrypted_password` = '$2a$10$WT0R3q2/jSJzrmJwhgxf1uRRYMAFok6np2gjdgSQEcf4dqUIbFXJi', `updated_at` = '2014-09-09 03:11:29' WHERE `users`.`id` = 39

    def set_user
      @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL ORDER BY `users`.`id` ASC LIMIT 1